/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isprint.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tchariss <tchariss@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/09 11:32:02 by tchariss          #+#    #+#             */
/*   Updated: 2020/11/18 11:58:28 by tchariss         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int	ft_isprint(int c)
/* Проверяет, является ли симвом отображаемым (печатаемым, включая пробел)
*От 32(space) до 126 ( по ascii )
**Возвращает 1(True) если символ печатный
**В другом случае 0(False) 
**
**Пример ("A") -> true(1)
**("(sp)") -> true(1)
 ("DEL") -> false */
{
	if ( c >= 32 && c <= 126)	
		return (1);
	return (0);
}

/* int main()
**{
**    char c;
*;
**     printf("%s", "Введите символ == отображаемый: ");
**    scanf("%c", &c );
**    printf("%i\n", ft_isprint(c));
**     return (0);
} */
