/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalpha.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tchariss <tchariss@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/11 19:45:00 by tchariss          #+#    #+#             */
/*   Updated: 2020/11/16 15:34:39 by tchariss         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int	ft_isalpha(int c)
{
	if ((c >= 65 && c <= 90 ) || (c >= 97 && c <= 122))	
		return (1);
	else
		return (0);
}

// int main()
// {
// 	char c;

// 	printf("%s", "Введите букву: ");	
// 	scanf("%c", &c );
// 	printf("%d\n", ft_isalpha(c));
// 	return (0);
// }
