/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstnew.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tchariss <tchariss@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/17 20:42:02 by tchariss          #+#    #+#             */
/*   Updated: 2020/11/19 17:33:37 by tchariss         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

t_list *ft_lstnew(void *content) // выделяет память на новый элемент и возвращает его
{
	t_list *list; // новыая структура названная list

	list = malloc(sizeof(t_list)); // выделяем память для сруктуры list 
	if (list == NULL)
		return (NULL);
	list -> content = content;  
	list -> next = NULL; // последнее звено должно иметь нулево	 указатель
	
	return (list);
}