/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_toupper.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tchariss <tchariss@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/09 11:34:02 by tchariss          #+#    #+#             */
/*   Updated: 2020/11/16 15:42:15 by tchariss         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int	ft_toupper(int c)

//Данный символ отображается на его эквивалент в верхнем регистре
//Если у символа нет эквивалента в верхнем регистре, возвращается сам символ

// "a" -> "A" 
{
	if ( c >= 97 && c <= 122) // a = 97, z = 122, a-32=A
		return (c -= 32);
	return (c);
}
/*
int main()
{
    int var1 = '8';
    int var2 = 'i';
    int var3 = 'R';
    char *var4 = "MaGic\n";
    
    printf("%c\n", ft_toupper(var1));
    printf("%c\n", ft_toupper(var2));
    printf("%c\n", ft_toupper(var3));
    while (*var4 != '\0')
    {
        printf("%c", ft_toupper(*var4)); // "\n" -> выводит в столбик
        var4++;
    }    
        
   // printf("%s неужели вывелось, но не так как нужно ;((((\n", (var4));
    
    return (0);
    }
*/