/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isdigit.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tchariss <tchariss@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/11 20:02:32 by tchariss          #+#    #+#             */
/*   Updated: 2020/11/16 15:34:47 by tchariss         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int	ft_isdigit(int c)
// возвразает true(1), если С - цифра 
// false(0) в других случаях
{
	if (c >= 48 && c <= 57) 
		return(1);	
	return(0);
}
// {
//     return ( c >= 48 && c <= 57 );
// }
// int main()
// {
//     char c;

//     printf("%s\n", "Введите цифру(1-9) и не только :");
//     scanf("%c", &c);
//     printf("%d\n", ft_isdigit(c));
//     return 0;
// }