/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isascii.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tchariss <tchariss@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/09 11:31:57 by tchariss          #+#    #+#             */
/*   Updated: 2020/11/16 15:34:43 by tchariss         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int	ft_isascii(int c)
/* проверяет, является ли c 7-битным unsigned char, значение которого попадает в таблицу символов ASCII */

// от 0 до 127 ( по ascii )
{
	if (c >= 0 && c <= 127)
		return(1);
    return(0);
}
/*
int main()
{
    char c;

    printf("Введите символ(ascii): ");
    scanf("%c", &c );
    printf("%d\n", ft_isascii(c));
    return (0);
}
*/