/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstadd_front.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tchariss <tchariss@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/18 19:51:00 by tchariss          #+#    #+#             */
/*   Updated: 2020/11/20 12:29:13 by tchariss         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void ft_lstadd_front(t_list **lst, t_list *new) //добавляет элемент new и помещает в начало(голову) списка
{
	if (new != NULL)
	{
		new -> next = *lst;  // ставим new рядом c ??????
		*lst = new; // помещаем new в начало нашего списка ( *lst - само первое звено )
	}
}
