/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstiter.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tchariss <tchariss@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/19 15:25:20 by tchariss          #+#    #+#             */
/*   Updated: 2020/11/19 18:55:50 by tchariss         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

void	ft_lstiter(t_list *lst, void (*f)(void *))
{
	while(lst != NULL && f != NULL)
	{
		(*f)(lst); // применяем f к каждой ссылке в нашем list
		lst = lst -> next; // lst равен указ на след звено
	}
}
// по примеру strmapi