/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putendl_fd.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tchariss <tchariss@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/16 19:37:34 by tchariss          #+#    #+#             */
/*   Updated: 2020/11/17 10:39:53 by tchariss         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
// Выводит строку 's' для данного файла дескриптор, за которым следует новая строка.
void	ft_putendl_fd(char *s, int fd)
{
	ft_putstr_fd(s, fd); // строка
	write (fd, "\n", 1); // новая строка (\n)
}