/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalnum.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tchariss <tchariss@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/11 19:43:48 by tchariss          #+#    #+#             */
/*   Updated: 2020/11/18 11:33:28 by tchariss         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int	ft_isalnum(int c)
{
	if (( c >= 48 && c <= 57 ) || ( c >= 65 && c <= 90 )||( c >= 97 && c <= 122 ))
		return (1);
	else
	{
		return (0);
	}
}

// int main()
// {
//     char c;

//     printf("Введите символ: ");
//     scanf("%c", c);
//     printf("%i\n", ft_isalnum(c));
//     return(0);    
// }
