/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstsize.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tchariss <tchariss@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/18 19:51:39 by tchariss          #+#    #+#             */
/*   Updated: 2020/11/19 16:33:00 by tchariss         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int ft_lstsize(t_list *lst) // считает количество элементов в строке
{
	int	a;

	a = 0; // счетчик вхождений 
	while (lst != NULL) // пока не конец списка и lst существует ( длина пустого списка равна нулю )
	{ 
 		lst = lst -> next; // переход к след звену , сохранение на след узел ( next ) 
		a++;
	}
	return a;
}

/*
Список либо пуст ( lst == NULL )
Либо состоит из головы(1 элем) и хвоста(всё, кроме первого + конец)
*/