/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strlen.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tchariss <tchariss@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/09 11:33:20 by tchariss          #+#    #+#             */
/*   Updated: 2020/11/17 10:58:49 by tchariss         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
/* Функция strlen вычисляет количество символов в строке до первого вхождения символа конца строки. 
При этом символ конца строки не входит в подсчитанное количество символов.*/
size_t	ft_strlen(const char *s)//** возвращает длину строки
{
	size_t i;

	i = 0;
	while (s[i] != '\0')
	{
		i++;
	}
	return (i);
}

// int main()
// {
//    char s[] = "Hello";

//     printf("%zu\n", ft_strlen(s));
//  return (0);
// }
