/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strncmp.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tchariss <tchariss@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/09 11:32:32 by tchariss          #+#    #+#             */
/*   Updated: 2020/11/17 17:11:09 by tchariss         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

int	ft_strncmp(const char *s1, const char *s2, size_t n)
//s1, s2 - первая, вторая строка
// n  - количество символов, используемых в сравнении.
// cравнивает не более первых n-символов двух строк
// возвращает 0, если идентичны
// вовзращает *s1 - *s2, если встретились различающиеся символы
{
	size_t i;

	i = 0;
	if ( n == 0 )
		return (0);
	while (s1[i] != '\0' && s1[i] == s2[i] &&  i < n - 1 )
	{
		i++;
	}
	return ((unsigned char)s1[i] - (unsigned char)s2[i]);
}

/*
int main()
{
    int a;
    a = ft_strncmp("abcd", "abcg", 4);
    printf("strcmp(str1, str3) = %d\n", a);
    return 0;
}
*/