/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strmapi.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tchariss <tchariss@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/09 11:32:30 by tchariss          #+#    #+#             */
/*   Updated: 2020/11/16 17:09:46 by tchariss         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/* Функция ft_strmapi применяет функцию f к каждому символу строки s, переданной в качестве аргумента, 
указав ее индекс в качестве первого аргумента, чтобы создать «свежую» новую строку (с malloc), 
полученную в результате последовательного применения f */
char *ft_strmapi(char const *s, char (*f)(unsigned int, char))
{
	int a;
	char *s1; //созданная строка 
	size_t len;
	
	a = 0;
	if (s == NULL)
		return (NULL);
	len = ft_strlen(s);
	if (!(s1 = malloc(sizeof(char) * len + 1))) // (ft_strlen(s)) + 1 - память для строки , кот потом вернем s1
	// if (!(malloc ...)) - если память не удается выделить, вернем null 
		return (NULL);
	while (s[a] != '\0')
	{
		s1[a] = f(a, s[a]);
		a++;
	}
	s1[a] = '\0';
	return(s1);
}                 