/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_tolower.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tchariss <tchariss@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/11 20:02:11 by tchariss          #+#    #+#             */
/*   Updated: 2020/11/16 15:42:03 by tchariss         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
/*
Функция tolower возвращает соответствующий нижнему регистру эквивалент символа c, 
если c — это буква верхнего регистра. В противном случае c возвращается неизмененным.
*/

int	ft_tolower(int c) // Возвращает строку в нижнем регистре
{
	if (( c >= 'A' ) && ( c <= 'Z' ))
		return(c + 32);
	else
		return (c);
}
// int main(void)
// {
//     char c;
//     char *str = "VIkToRiNa\n";

//     printf("Введите букву: "); //
//     scanf("%c", &c );
//     printf("%c\n", ft_tolower(c));
//     while (*str != '\0')
//         {
//             printf("%c", ft_tolower(*str));
//             str++;
//         }
//     return (0);
// }
